lesson/17_artillery/test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: "TodoService"

scenarios:
  - name: "get todo"
    flow:
      - get:
          url: "/todo-items"
          headers:
            Authorization: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwibmFtZSI6IuyasOykgO2YuCIsImVtYWlsIjoibm9nZ29uZ0BleGFtcGxlLmNvbSIsInJvbGUiOiJ0dXRvciIsImlhdCI6MTcyMTIxNjAwOX0.UOsNOog71HQ2z9M53aHDuerl5GTx0ZosrSC-B-PLXpE"